chat_system_2079569843_actor_description=King Mark. Our glorious king.
chat_system_2079569843_snap_6_question=^?^Don't worry, [player], you will be searching like - a Royal Searcher.<br>At the moment everything may look peaceful and calm, but that's just a semblance. You must have heard about the guileful dwarven attack on the Creiston Mines. The dwarves broke the lease, and determined to occupy our mines by force - but thanks to Baron Ahey's assistance, we've managed to push them back.<br>Our advisors are sure that this won't stop them, and there is need to prepare for war. To do that, we require the maps of the dwarven mines and caves, so that we will know when and where we should await the attack, and perhaps even make a preemptive strike.
chat_system_2079569843_snap_6_answer_0=^?^(Listen further...)
chat_system_2079569843_snap_0_question=^?^We've found out that one of the pirate "Barons" has such maps - a pirate named James, nicknamed Lucky. You will need to go to the Islands of Freedom, find this James and acquire from him the maps of the dwarven undergrounds - at any cost!<br><br>Oh, and yes... For your faithful service to Darion and to Our Majesty, I, King Mark Leonard the Second, confer upon you the title of [rank] and the regalia which thereto appertain! Bow your head, my loyal friend.
chat_system_2079569843_snap_0_answer_0=^?^Thank you, Your Majesty. I will get those maps by whatever means necessary!
chat_system_2079569843_snap_1_question=^?^Any questions [player]? We thought that you were already on the islands, searching for the dwarves' maps.<br>Or maybe you've found them already?
chat_system_2079569843_snap_1_answer_0=^?^Yes, I've brought the maps!
chat_system_2079569843_snap_1_answer_1=^?^I spoke to Lucky James. He demands no less than a hundred thousand gold coins for the maps!
chat_system_2079569843_snap_1_answer_2=^?^I'd like to know how I can get to the Islands.
chat_system_2079569843_snap_4_question=^?^Great job, [player]! Come on, give them to me... <br>...well, excellent... here are their secret passes, here the fortifications... our military strategists will be quite pleased...<br>[reward]<br><br>I just don't understand how mere pirates managed to acquire such precious information.
chat_system_2079569843_snap_4_answer_0=^?^The pirate got this information from some dwarven slaves which he bought here in Greenwort, from the local robber, Rotten Hake.
chat_system_2079569843_snap_5_question=^?^What? What slaves? Somebody trading slaves - and dwarves at that - right under our noses? Well... of course I can't say I feel sorry for the dwarves, under the present circumstances. But slave trade was outlawed in Darion centuries ago!<br>This is no good! While we prepare for war, you must find and punish these criminals. The law is the law, and as for slave trade - trade of any intelligent creatures is strictly prohibited. At the same time, I'd also like to know how these dwarves got here in the first place!
chat_system_2079569843_snap_5_answer_0=^?^Don't worry; I'll sort out that slave trader immediately.
chat_system_2079569843_snap_3_question=^?^One hundred thousand?! Ha-ha-ha! How about we just give him half the kingdom? [player], we will give no more than 5000 gold coins. If that impudent pirate isn't satisfied, then you'll just have to persuade him. <br>A pirate's head is a small price to pay for peace in Darion.
chat_system_2079569843_snap_3_answer_0=^?^I understand, Your Majesty! That money will be enough, whether he likes it or not.
chat_system_2079569843_snap_2_question=^?^Go to our northern port. There you will find Kitano, the head of fishing village. He'll take you where you need to go.
chat_system_2079569843_snap_2_answer_0=^?^I am on my way, sire. Thank you!
